In [1]:
import pandas as pd
import sqlalchemy as sql

In [2]:
database_connection_string = 'sqlite:///'

In [3]:
engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [4]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_13780\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]

In [5]:
stocks_dataframe = pd.DataFrame(
    {
        'AAPL': [
            1,
            2
        ]
        ,
        'GOOG': [
            3,
            4
        ]
    }
)

stocks_dataframe

   AAPL  GOOG
0     1     3
1     2     4

In [6]:
stocks_dataframe.to_sql(
    'stocks',
    engine
)

2

In [7]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_13780\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [8]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   index  AAPL  GOOG
0      0     1     3
1      1     2     4

In [9]:
stocks_dataframe.to_sql(
    'stocks',
    engine,
    index= False,
    if_exists= 'replace'
)

2

In [10]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con= engine
)

sql_stocks_df

   AAPL  GOOG
0     1     3
1     2     4

___

# Skill Drill

In [11]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string
)

engine

Engine(sqlite:///)

In [12]:
stocks_df = pd.DataFrame(
    {
        'MSFT': [
            5,
            6
        ]
        ,
        'TSLA': [
            7,
            8
        ]
    }
)

stocks_df

   MSFT  TSLA
0     5     7
1     6     8

In [13]:
stocks_df.to_sql(
    'stocks',
    engine
)

2

In [14]:
engine.table_names()

C:\Users\admin\AppData\Local\Temp\ipykernel_13780\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['stocks']

In [15]:
sql_stocks_df = pd.read_sql_table(
    'stocks',
    con = engine
)

sql_stocks_df

   index  MSFT  TSLA
0      0     5     7
1      1     6     8

___

In [16]:
database_connection_string = 'sqlite:///'

engine = sql.create_engine(
    database_connection_string,
    echo = True
)

engine

Engine(sqlite:///)

In [17]:
stocks_dataframe

   AAPL  GOOG
0     1     3
1     2     4

In [18]:
stocks_dataframe.to_sql(
    'stocks',
    engine,
    index=False,
    if_exists='replace'
)

2023-02-10 01:22:10,277 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("stocks")
2023-02-10 01:22:10,279 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,280 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("stocks")
2023-02-10 01:22:10,281 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,284 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-10 01:22:10,287 INFO sqlalchemy.engine.Engine
CREATE TABLE stocks (
	"AAPL" BIGINT,
	"GOOG" BIGINT
)


2023-02-10 01:22:10,290 INFO sqlalchemy.engine.Engine [no key 0.00187s] ()
2023-02-10 01:22:10,292 INFO sqlalchemy.engine.Engine COMMIT
2023-02-10 01:22:10,294 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-02-10 01:22:10,295 INFO sqlalchemy.engine.Engine INSERT INTO stocks ("AAPL", "GOOG") VALUES (?, ?)
2023-02-10 01:22:10,295 INFO sqlalchemy.engine.Engine [generated in 0.00140s] ((1, 3), (2, 4))
2023-02-10 01:22:10,298 INFO sqlalchemy.engine.Engine COMMIT

2

In [19]:
create_table = """
CREATE TABLE stocks (
    'AAPL' BIGINT,
    'GOOG' BIGINT
)

"""

create_table

"\nCREATE TABLE stocks (\n    'AAPL' BIGINT,\n    'GOOG' BIGINT\n)\n\n"

___

In [20]:
create_table = """

CREATE TABLE delicious_stocks (
    'EAT' BIGINT,
    'CAKE' BIGINT
)

"""

create_table

"\n\nCREATE TABLE delicious_stocks (\n    'EAT' BIGINT,\n    'CAKE' BIGINT\n)\n\n"

In [21]:
engine.execute(
    create_table
)

2023-02-10 01:22:10,357 INFO sqlalchemy.engine.Engine

CREATE TABLE delicious_stocks (
    'EAT' BIGINT,
    'CAKE' BIGINT
)


2023-02-10 01:22:10,357 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,362 INFO sqlalchemy.engine.Engine COMMIT

In [22]:
engine.table_names()

2023-02-10 01:22:10,383 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-02-10 01:22:10,384 INFO sqlalchemy.engine.Engine [raw sql] ()

C:\Users\admin\AppData\Local\Temp\ipykernel_13780\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['delicious_stocks', 'stocks']

In [23]:
pd.read_sql_table(
    'delicious_stocks',
    con=engine
)

2023-02-10 01:22:10,405 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("delicious_stocks")
2023-02-10 01:22:10,413 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,415 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("delicious_stocks")
2023-02-10 01:22:10,417 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,417 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,417 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,422 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("delicious_stocks")
2023-02-10 01:22:10,422 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,426 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("delicious_stocks")
2023-02-10 01:22:10,428 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,430 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,432 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,433 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-10 01:22:10,436 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,437 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-10 01:22:10,439 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,441 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-10 01:22:10,443 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,445 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-10 01:22:10,445 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,445 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,451 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,453 INFO sqlalchemy.engine.Engine SELECT delicious_stocks."EAT", delicious_stocks."CAKE"
FROM delicious_stocks
2023-02-10 01:22:10,453 INFO sqlalchemy.engine.Engine [generated in 0.00105s] ()

Empty DataFrame
Columns: [EAT, CAKE]
Index: []

In [24]:
insert_data = """

INSERT INTO delicious_stocks (
    'EAT',
    'CAKE'
)

VALUES (
    ?,
    ?
)

"""

In [25]:
engine.execute(
    insert_data,
    (
        (
            10,
            30
        )
        ,
        (
            20,
            40
        )
    )
)

2023-02-10 01:22:10,491 INFO sqlalchemy.engine.Engine

INSERT INTO delicious_stocks (
    'EAT',
    'CAKE'
)

VALUES (
    ?,
    ?
)


2023-02-10 01:22:10,495 INFO sqlalchemy.engine.Engine [raw sql] ((10, 30), (20, 40))
2023-02-10 01:22:10,495 INFO sqlalchemy.engine.Engine COMMIT

In [26]:
pd.read_sql_table(
    'delicious_stocks',
    con=engine
)

2023-02-10 01:22:10,517 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("delicious_stocks")
2023-02-10 01:22:10,519 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,523 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("delicious_stocks")
2023-02-10 01:22:10,523 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,527 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,528 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,532 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("delicious_stocks")
2023-02-10 01:22:10,534 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,536 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("delicious_stocks")
2023-02-10 01:22:10,536 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,538 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,540 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,542 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-10 01:22:10,543 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,543 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-10 01:22:10,546 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,546 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("delicious_stocks")
2023-02-10 01:22:10,550 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,551 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("delicious_stocks")
2023-02-10 01:22:10,552 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-02-10 01:22:10,555 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-02-10 01:22:10,557 INFO sqlalchemy.engine.Engine [raw sql] ('delicious_stocks',)
2023-02-10 01:22:10,560 INFO sqlalchemy.engine.Engine SELECT delicious_stocks."EAT", delicious_stocks."CAKE"
FROM delicious_stocks
2023-02-10 01:22:10,561 INFO sqlalchemy.engine.Engine [generated in 0.00111s] ()

   EAT  CAKE
0   10    30
1   20    40

In [27]:
read_all_data = """
SELECT 'EAT', 'CAKE' FROM delicious_stocks
"""

engine.execute(
    read_all_data
)

2023-02-10 01:22:10,585 INFO sqlalchemy.engine.Engine
SELECT 'EAT', 'CAKE' FROM delicious_stocks

2023-02-10 01:22:10,591 INFO sqlalchemy.engine.Engine [raw sql] ()

In [29]:
read_all_data = """
SELECT "EAT", "CAKE"
FROM delicious_stocks
"""

results = engine.execute(
    read_all_data
)

for row in results:
    print(row)

2023-02-10 01:23:58,513 INFO sqlalchemy.engine.Engine
SELECT "EAT", "CAKE"
FROM delicious_stocks

2023-02-10 01:23:58,514 INFO sqlalchemy.engine.Engine [raw sql] ()
(10, 30)
(20, 40)

In [30]:
results = engine.execute(
    read_all_data
)
list(results)

2023-02-10 01:27:12,041 INFO sqlalchemy.engine.Engine
SELECT "EAT", "CAKE"
FROM delicious_stocks

2023-02-10 01:27:12,042 INFO sqlalchemy.engine.Engine [raw sql] ()

[(10, 30), (20, 40)]

In [31]:
read_all_data = """
SELECT * FROM delicious_stocks
"""

results = engine.execute(
    read_all_data
)

list(results)

2023-02-10 01:40:55,366 INFO sqlalchemy.engine.Engine
SELECT * FROM delicious_stocks

2023-02-10 01:40:55,368 INFO sqlalchemy.engine.Engine [raw sql] ()

[(10, 30), (20, 40)]